{
    "topics": [
        {
            "title": "Introduction to Atoms and Molecules",
            "stages": [
                {
                    "type": "text",
                    "heading": "Ancient Philosophy",
                    "content": "Ancient Indian and Greek philosophers wondered about the unseen form of matter. Maharishi Kanad postulated that if we divide matter (padarth), we will get smaller particles called 'Parmanu'. Democritus called these indivisible particles 'atoms'."
                },
                {
                    "type": "text",
                    "heading": "Foundation of Chemical Sciences",
                    "content": "By the end of the eighteenth century, scientists recognised the difference between elements and compounds. Antoine L. Lavoisier laid the foundation of chemical sciences by establishing two important laws of chemical combination."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 1: Quick Quiz"
                }
            ]
        },
        {
            "title": "Law of Conservation of Mass",
            "stages": [
                {
                    "type": "text",
                    "heading": "The Law",
                    "content": "Is there a change in mass when a chemical reaction takes place? The Law of Conservation of Mass states that mass can neither be created nor destroyed in a chemical reaction."
                },
                {
                    "type": "text",
                    "heading": "Experiment",
                    "content": "If you carry out a reaction in a closed flask (so nothing escapes), the total mass of the flask and its contents remains unchanged before and after the reaction."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 2: Quick Quiz"
                }
            ]
        },
        {
            "title": "Law of Constant Proportions",
            "stages": [
                {
                    "type": "text",
                    "heading": "Definite Proportions",
                    "content": "This law, also known as the Law of Definite Proportions, was stated by Proust: 'In a chemical substance the elements are always present in definite proportions by mass'."
                },
                {
                    "type": "text",
                    "heading": "Example: Water",
                    "content": "In water, the ratio of the mass of hydrogen to the mass of oxygen is always 1:8. Thus, if 9g of water is decomposed, 1g of hydrogen and 8g of oxygen are always obtained, regardless of the source."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 3: Quick Quiz"
                }
            ]
        },
        {
            "title": "Dalton's Atomic Theory",
            "stages": [
                {
                    "type": "text",
                    "heading": "The Theory",
                    "content": "John Dalton provided the basic theory about the nature of matter in 1808. It provided an explanation for the laws of conservation of mass and definite proportions."
                },
                {
                    "type": "text",
                    "heading": "Postulates",
                    "content": "1. All matter is made of tiny atoms. 2. Atoms are indivisible and cannot be created or destroyed. 3. Atoms of a given element are identical in mass and properties. 4. Atoms of different elements have different masses and properties. 5. Atoms combine in small whole numbers to form compounds."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 4: Quick Quiz"
                }
            ]
        },
        {
            "title": "What is an Atom?",
            "stages": [
                {
                    "type": "text",
                    "heading": "Building Blocks",
                    "content": "Atoms are the building blocks of all matter. Just as a small grain of sand is the building block of an ant-hill, atoms build up everything we see."
                },
                {
                    "type": "text",
                    "heading": "Size of Atoms",
                    "content": "Atoms are very small, smaller than anything we can imagine. Atomic radius is measured in nanometres. 1 nm = 10^-9 m. Millions of atoms stacked would barely make a sheet of paper."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 5: Quick Quiz"
                }
            ]
        },
        {
            "title": "Modern Day Symbols of Elements",
            "stages": [
                {
                    "type": "text",
                    "heading": "IUPAC Symbols",
                    "content": "Dalton was the first to use specific symbols. Nowadays, IUPAC approves names and symbols. Symbols are usually the first one or two letters of the element's name in English (e.g., Hydrogen is H, Aluminium is Al)."
                },
                {
                    "type": "text",
                    "heading": "Latin Roots",
                    "content": "Some symbols come from Latin names. For example, Iron is Fe (Ferrum), Sodium is Na (Natrium), and Potassium is K (Kalium)."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 6: Quick Quiz"
                }
            ]
        },
        {
            "title": "Atomic Mass",
            "stages": [
                {
                    "type": "text",
                    "heading": "Relative Mass",
                    "content": "Dalton proposed that each element had a characteristic atomic mass. Since individual atoms are too small to weigh, scientists determine relative atomic masses."
                },
                {
                    "type": "text",
                    "heading": "Carbon-12 Standard",
                    "content": "In 1961, the carbon-12 isotope was chosen as the standard reference. One atomic mass unit (u) is a mass unit equal to exactly one-twelfth (1/12th) the mass of one atom of carbon-12."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 7: Quick Quiz"
                }
            ]
        },
        {
            "title": "How Do Atoms Exist?",
            "stages": [
                {
                    "type": "text",
                    "heading": "Stability",
                    "content": "Atoms of most elements are not able to exist independently. Atoms form molecules and ions. These aggregate in large numbers to form the matter that we can see, feel, or touch."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 8: Quick Quiz"
                }
            ]
        },
        {
            "title": "What is a Molecule?",
            "stages": [
                {
                    "type": "text",
                    "heading": "Definition",
                    "content": "A molecule is a group of two or more atoms that are chemically bonded together. It is the smallest particle of an element or compound that is capable of independent existence and shows all properties of that substance."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 9: Quick Quiz"
                }
            ]
        },
        {
            "title": "Molecules of Elements",
            "stages": [
                {
                    "type": "text",
                    "heading": "Same Type of Atoms",
                    "content": "The molecules of an element are constituted by the same type of atoms. For example, Argon (Ar) and Helium (He) are monoatomic."
                },
                {
                    "type": "text",
                    "heading": "Atomicity",
                    "content": "Most non-metals exist as molecules of multiple atoms. Oxygen is diatomic (O2). Ozone is triatomic (O3). Phosphorus is tetra-atomic (P4). The number of atoms constituting a molecule is known as its atomicity."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 10: Quick Quiz"
                }
            ]
        },
        {
            "title": "Molecules of Compounds",
            "stages": [
                {
                    "type": "text",
                    "heading": "Different Types of Atoms",
                    "content": "Atoms of different elements join together in definite proportions to form molecules of compounds. For example, Water (H2O) has Hydrogen and Oxygen in a 1:8 mass ratio."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 11: Quick Quiz"
                }
            ]
        },
        {
            "title": "What is an Ion?",
            "stages": [
                {
                    "type": "text",
                    "heading": "Charged Species",
                    "content": "Compounds composed of metals and non-metals contain charged species known as ions. An ion can be negatively or positively charged."
                },
                {
                    "type": "text",
                    "heading": "Cations and Anions",
                    "content": "A negatively charged ion is called an 'anion' (e.g., Chloride Cl-). A positively charged ion is called a 'cation' (e.g., Sodium Na+). A group of atoms carrying a charge is known as a polyatomic ion."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 12: Quick Quiz"
                }
            ]
        },
        {
            "title": "Writing Chemical Formulae",
            "stages": [
                {
                    "type": "text",
                    "heading": "Valency",
                    "content": "The chemical formula is a symbolic representation of composition. The combining power of an element is known as its valency. Valency is used to find out how atoms of an element will combine with another."
                },
                {
                    "type": "text",
                    "heading": "Rules",
                    "content": "1. Valencies or charges must balance. 2. Metal symbol is written first (on the left). 3. Polyatomic ions are enclosed in brackets if more than one is present."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 13: Quick Quiz"
                }
            ]
        },
        {
            "title": "Formulae of Simple Compounds",
            "stages": [
                {
                    "type": "text",
                    "heading": "Criss-Cross Method",
                    "content": "To write the formula, write the constituent elements and their valencies below them. Then crossover the valencies of the combining atoms."
                },
                {
                    "type": "text",
                    "heading": "Example",
                    "content": "For Hydrogen Chloride: Symbol H and Cl. Valency 1 and 1. Formula is HCl. For Magnesium Chloride: Symbol Mg and Cl. Valency 2 and 1. Formula is MgCl2."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 14: Quick Quiz"
                }
            ]
        },
        {
            "title": "Molecular Mass",
            "stages": [
                {
                    "type": "text",
                    "heading": "Calculation",
                    "content": "The molecular mass of a substance is the sum of the atomic masses of all the atoms in a molecule. It is expressed in atomic mass units (u)."
                },
                {
                    "type": "text",
                    "heading": "Example",
                    "content": "For water (H2O): 2 x (mass of H) + 1 x (mass of O) = 2x1 + 16 = 18 u."
                },
                {
                    "type": "text",
                    "heading": "Formula Unit Mass",
                    "content": "It is calculated in the same way but used for substances whose constituent particles are ions (like NaCl)."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 15: Quick Quiz"
                }
            ]
        }
    ]
}
