{
    "topics": [
        {
            "title": "Production of Sound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Vibration",
                    "content": "Sound is produced by vibrating objects. Vibration means a kind of rapid to and fro motion of an object."
                },
                {
                    "type": "text",
                    "heading": "Examples",
                    "content": "The sound of the human voice is produced due to vibrations in the vocal cords. A stretched rubber band when plucked vibrates and produces sound."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 1: Quick Quiz"
                }
            ]
        },
        {
            "title": "Propagation of Sound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Medium",
                    "content": "The matter or substance through which sound is transmitted is called a medium. It can be solid, liquid, or gas."
                },
                {
                    "type": "text",
                    "heading": "Mechanism",
                    "content": "When an object vibrates, it sets the particles of the medium around it vibrating. The particles do not travel all the way from the vibrating object to the ear, but the disturbance travels."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 2: Quick Quiz"
                }
            ]
        },
        {
            "title": "Sound Waves are Longitudinal",
            "stages": [
                {
                    "type": "text",
                    "heading": "Compressions and Rarefactions",
                    "content": "When a vibrating object moves forward, it creates a region of high pressure called compression (C). When it moves backward, it creates a region of low pressure called rarefaction (R)."
                },
                {
                    "type": "text",
                    "heading": "Longitudinal Nature",
                    "content": "In sound waves, the individual particles of the medium move in a direction parallel to the direction of propagation of the disturbance. Hence, sound waves are longitudinal waves."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 3: Quick Quiz"
                }
            ]
        },
        {
            "title": "Characteristics of a Sound Wave",
            "stages": [
                {
                    "type": "text",
                    "heading": "Description",
                    "content": "We can describe a sound wave by its frequency, amplitude, and speed."
                },
                {
                    "type": "text",
                    "heading": "Graphical Representation",
                    "content": "A sound wave represents how density and pressure change. A peak represents the region of maximum compression (crest) and a valley represents the region of maximum rarefaction (trough)."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 4: Quick Quiz"
                }
            ]
        },
        {
            "title": "Wavelength and Frequency",
            "stages": [
                {
                    "type": "text",
                    "heading": "Wavelength",
                    "content": "The distance between two consecutive compressions or two consecutive rarefactions is called the wavelength (λ). Its SI unit is metre (m)."
                },
                {
                    "type": "text",
                    "heading": "Frequency",
                    "content": "The number of complete oscillations per unit time is the frequency (ν). Its SI unit is hertz (Hz)."
                },
                {
                    "type": "text",
                    "heading": "Time Period",
                    "content": "The time taken for one complete oscillation is called the time period (T). Frequency v = 1/T."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 5: Quick Quiz"
                }
            ]
        },
        {
            "title": "Pitch and Loudness",
            "stages": [
                {
                    "type": "text",
                    "heading": "Pitch",
                    "content": "How the brain interprets the frequency of an emitted sound is called its pitch. Faster vibration means higher frequency and higher pitch."
                },
                {
                    "type": "text",
                    "heading": "Loudness",
                    "content": "Loudness is determined by the amplitude of the wave. Large amplitude means loud sound. It depends on the force with which an object is made to vibrate."
                },
                {
                    "type": "text",
                    "heading": "Quality",
                    "content": "Quality or timber enables us to distinguish one sound from another having the same pitch and loudness. A sound of single frequency is a tone; a mixture is a note."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 6: Quick Quiz"
                }
            ]
        },
        {
            "title": "Speed of Sound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Formula",
                    "content": "Speed (v) = distance / time = wavelength (λ) × frequency (ν)."
                },
                {
                    "type": "text",
                    "heading": "Factors",
                    "content": "The speed of sound depends on the properties of the medium (temperature, state). It decreases from solid to gaseous state. In air at 22°C, it is 344 m/s."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 7: Quick Quiz"
                }
            ]
        },
        {
            "title": "Reflection of Sound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Laws of Reflection",
                    "content": "Sound bounces off a solid or a liquid like a rubber ball. The directions of incident and reflected sound make equal angles with the normal, and all three are in the same plane."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 8: Quick Quiz"
                }
            ]
        },
        {
            "title": "Echo",
            "stages": [
                {
                    "type": "text",
                    "heading": "Definition",
                    "content": "If we shout near a reflecting object, we hear the same sound again. This is called an echo."
                },
                {
                    "type": "text",
                    "heading": "Conditions",
                    "content": "To hear a distinct echo, the time interval between the original and reflected sound must be at least 0.1 s. At 22°C, the minimum distance to the obstacle must be 17.2 m."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 9: Quick Quiz"
                }
            ]
        },
        {
            "title": "Reverberation",
            "stages": [
                {
                    "type": "text",
                    "heading": "Persistence of Sound",
                    "content": "The repeated reflection that results in the persistence of sound in a big hall is called reverberation."
                },
                {
                    "type": "text",
                    "heading": "Reduction",
                    "content": "To reduce reverberation, the roof and walls of the auditorium are generally covered with sound-absorbent materials like compressed fibreboard or draperies."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 10: Quick Quiz"
                }
            ]
        },
        {
            "title": "Uses of Multiple Reflection",
            "stages": [
                {
                    "type": "text",
                    "heading": "Instruments",
                    "content": "Megaphones, horns, and trumpets are designed to send sound in a particular direction using multiple reflection."
                },
                {
                    "type": "text",
                    "heading": "Stethoscope",
                    "content": "In stethoscopes, the sound of the patient's heartbeat reaches the doctor's ears by multiple reflection of sound."
                },
                {
                    "type": "text",
                    "heading": "Ceilings",
                    "content": "Ceilings of concert halls are curved so that sound after reflection reaches all corners."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 11: Quick Quiz"
                }
            ]
        },
        {
            "title": "Range of Hearing",
            "stages": [
                {
                    "type": "text",
                    "heading": "Audible Range",
                    "content": "The audible range of sound for human beings extends from about 20 Hz to 20000 Hz (20 kHz)."
                },
                {
                    "type": "text",
                    "heading": "Age Factor",
                    "content": "Children under five and some animals like dogs can hear up to 25 kHz. As people grow older, their ears become less sensitive to higher frequencies."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 12: Quick Quiz"
                }
            ]
        },
        {
            "title": "Infrasound and Ultrasound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Infrasound",
                    "content": "Sounds of frequencies below 20 Hz are called infrasonic sound or infrasound. Whales and elephants produce sound in the infrasound range."
                },
                {
                    "type": "text",
                    "heading": "Ultrasound",
                    "content": "Frequencies higher than 20 kHz are called ultrasonic sound or ultrasound. Dolphins, bats, and porpoises produce ultrasound."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 13: Quick Quiz"
                }
            ]
        },
        {
            "title": "Applications of Ultrasound",
            "stages": [
                {
                    "type": "text",
                    "heading": "Cleaning",
                    "content": "Ultrasound is used to clean parts located in hard-to-reach places (e.g., spiral tubes, electronic components). Dust and dirt get detached due to high frequency."
                },
                {
                    "type": "text",
                    "heading": "Flaw Detection",
                    "content": "Ultrasounds can be used to detect cracks and flaws in metal blocks. If there is a defect, the ultrasound gets reflected back."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 14: Quick Quiz"
                }
            ]
        },
        {
            "title": "Medical Applications",
            "stages": [
                {
                    "type": "text",
                    "heading": "Echocardiography",
                    "content": "Ultrasonic waves are made to reflect from various parts of the heart and form the image of the heart."
                },
                {
                    "type": "text",
                    "heading": "Ultrasonography",
                    "content": "Ultrasound scanner is used for getting images of internal organs (liver, kidney, etc.) and for examining the foetus during pregnancy."
                },
                {
                    "type": "text",
                    "heading": "Lithotripsy",
                    "content": "Ultrasound may be employed to break small 'stones' formed in the kidneys into fine grains."
                },
                {
                    "type": "quiz",
                    "heading": "Topic 15: Quick Quiz"
                }
            ]
        }
    ]
}
