[{"id":1,"id_kural":"k_1","line1":"அகர முதல எழுத்தெல்லாம் ஆதி","line2":"பகவன் முதற்றே உலகு.","english":"'A' leads letters; the Ancient Lord Leads and lords the entire world","en_explanation":"As the letter A is the first of all letters, so the eternal God is first in the world","tamil":"எழுத்துக்கள் எல்லாம் அகரத்தில் தொடங்குகின்றன; (அது போல) உலகம் கடவுளில் தொடங்குகிறது.","tl_ta_as_eng":"Akara Mudhala Ezhuththellaam Aadhi Pakavan Mudhatre Ulaku","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":2,"id_kural":"k_2","line1":"கற்றதனால் ஆய பயனென்கொல் வாலறிவன்","line2":"நற்றாள் தொழாஅர் எனின்.","english":"That lore is vain which does not fall  At His good feet who knoweth all","en_explanation":"What Profit have those derived from learning, who worship not the good feet of Him who is possessed of pure knowledge ?","tamil":"தூய அறிவு வடிவானவனின் திருவடிகளை வணங்காதவர், படித்ததனால் பெற்ற பயன்தான் என்ன?","tl_ta_as_eng":"Katradhanaal Aaya Payanenkol Vaalarivan Natraal Thozhaaar Enin","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":3,"id_kural":"k_3","line1":"மலர்மிசை ஏகினான் மாணடி சேர்ந்தார்","line2":"நிலமிசை நீடுவாழ் வார்.","english":"Long they live on earth who gain The feet of God in florid brain","en_explanation":"They who are united to the glorious feet of Him who passes swiftly over the flower of the mind, shall flourish long above all worlds","tamil":"மனமாகிய மலர்மீது சென்று இருப்பவனாகிய கடவுளின் சிறந்த திருவடிகளை எப்போதும் நினைப்பவர் இப்பூமியில் நெடுங்காலம் வாழ்வர்","tl_ta_as_eng":"Malarmisai Ekinaan Maanati Serndhaar Nilamisai Neetuvaazh Vaar","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":4,"id_kural":"k_4","line1":"வேண்டுதல் வேண்டாமை இலானடி சேர்ந்தார்க்கு","line2":"யாண்டும் இடும்பை இல.","english":"Who hold His feet who likes nor loathes Are free from woes of human births","en_explanation":"To those who meditate the feet of Him who is void of desire or aversion, evil shall never come","tamil":"எதிலும் விருப்பு வெறுப்பு இல்லாத கடவுளின் திருவடிகளை மனத்தால் எப்போதும் நினைப்பவருக்கு உலகத் துன்பம் ஒருபோதும் இல்லை","tl_ta_as_eng":"Ventudhal Ventaamai Ilaanati Serndhaarkku Yaantum Itumpai Ila","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":5,"id_kural":"k_5","line1":"இருள்சேர் இருவினையும் சேரா இறைவன்","line2":"பொருள்சேர் புகழ்புரிந்தார் மாட்டு.","english":"God's praise who tell, are free from right  And wrong, the twins of dreaming night","en_explanation":"The two-fold deeds that spring from darkness shall not adhere to those who delight in the true praise of God","tamil":"கடவுளின் மெய்மைப் புகழையே விரும்புபவரிடம் அறியாமை இருளால் வரும் நல்வினை, தீவினை என்னும் இரண்டும் சேருவதில்லை","tl_ta_as_eng":"Irulser Iruvinaiyum Seraa Iraivan Porulser Pukazhpurindhaar Maattu","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":6,"id_kural":"k_6","line1":"பொறிவாயில் ஐந்தவித்தான் பொய்தீர் ஒழுக்க","line2":"நெறிநின்றார் நீடுவாழ் வார்.","english":"They prosper long who walk His way Who has the senses signed away","en_explanation":"Those shall long proposer who abide in the faultless way of Him who has destroyed the five desires of the senses","tamil":"மெய், வாய், கண், மூக்கு, செவி ஆகிய ஐந்து பொறிகளின் வழிப் பிறக்கும் தீய ஆசைகளை அழித்து கடவுளின் பொய்யற்ற ஒழுக்க வழியிலே நின்றவர் நெடுங்காலம் வாழ்வார்","tl_ta_as_eng":"Porivaayil Aindhaviththaan Poidheer Ozhukka Nerinindraar Neetuvaazh Vaar","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":7,"id_kural":"k_7","line1":"தனக்குவமை இல்லாதான் தாள்சேர்ந்தார்க் கல்லால்","line2":"மனக்கவலை மாற்றல் அரிது.","english":"His feet, whose likeness none can find, Alone can ease the anxious mind","en_explanation":"Anxiety of mind cannot be removed, except from those who are united to the feet of Him who is incomparable","tamil":"தனக்கு இணையில்லாத கடவுளின் திருவடிகளைச் சேர்ந்தவர்க்கே அன்றி, மற்றவர்களுக்கு மனக்கவலையைப் போக்குவது கடினம்","tl_ta_as_eng":"Thanakkuvamai Illaadhaan Thaalserndhaark Kallaal Manakkavalai Maatral Aridhu","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":8,"id_kural":"k_8","line1":"அறவாழி அந்தணன் தாள்சேர்ந்தார்க் கல்லால்","line2":"பிறவாழி நீந்தல் அரிது.","english":"Who swims the sea of vice is he Who clasps the feet of Virtue's sea","en_explanation":"None can swim the sea of vice, but those who are united to the feet of that gracious Being who is a sea of virtue","tamil":"அறக்கடலான கடவுளின் திருவடிகளை சேர்ந்தவரே அல்லாமல் மற்றவர் பிறவியாக கடலை நீந்திக் கடப்பது கடினம்","tl_ta_as_eng":"Aravaazhi Andhanan Thaalserndhaark Kallaal Piravaazhi Neendhal Aridhu","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":9,"id_kural":"k_9","line1":"கோளில் பொறியின் குணமிலவே எண்குணத்தான்","line2":"தாளை வணங்காத் தலை.","english":"Like senses stale that head is vain Which bows not to Eight-Virtued Divine","en_explanation":"The head that worships not the feet of Him who is possessed of eight attributes, is as useless as a sense without the power of sensation","tamil":"எண்ணும் நல்ல குணங்களுக்கு எல்லாம் இருப்பிடமான கடவுளின் திருவடிகளை வணங்காத தலைகள், புலன்கள் இல்லாத பொறிகள்போல, இருந்தும் பயன் இல்லாதவையே","tl_ta_as_eng":"Kolil Poriyin Kunamilave Enkunaththaan Thaalai Vanangaath Thalai","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"},{"id":10,"id_kural":"k_10","line1":"பிறவிப் பெருங்கடல் நீந்துவர் நீந்தார்","line2":"இறைவன் அடிசேரா தார்.","english":"The sea of births they alone swim Who clench His feet and cleave to Him","en_explanation":"None can swim the great sea of births but those who are united to the feet of God","tamil":"கடவுளின் திருவடிகளைச் சேர்ந்தவர் பிறவியாகிய பெருங்கடலை நீந்திக் கடப்பர்; மற்றவர் நீந்தவும் மாட்டார்","tl_ta_as_eng":"Piravip Perungatal Neendhuvar Neendhaar Iraivan Atiseraa Thaar","title_ta":"கடவுள் வாழ்த்து","id_title_ta":"1_கடவுள்_வாழ்த்து","title_en":"The Praise of God","id_title_en":"1_the_praise_of_god","tl_title_ta_as_eng":"Katavul Vaazhththu"}]